Tekla.Structures.DialogInternal.ManagedRebarSelectionDialogInterface
Handles access to object dialog callbacks

Tekla.Structures.DialogInternal.ManagedRebarSelectionDialogInterface.AttributeRequestedEvent
The attribute requested event

Tekla.Structures.DialogInternal.ManagedRebarSelectionDialogInterface.AttributeRequestedCallback(Tekla.Structures.DialogInternal.IDialogOwner,System.String,System.String,System.Double,System.Int32)
Callback function to be called from forms dialog
caller: Caller control
size: Rebar size
grade: Rebar grade
radius: Rebar radius
usage: Rebar usage
Returns: false if event handler is not specified , true otherwise